tap "fsouza/prettierd"
tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "bat"
brew "python@3.12"
brew "black"
brew "coreutils"
brew "cask"
brew "colima", restart_service: true
brew "docker"
brew "docker-compose"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "grep"
brew "htop"
brew "jq"
brew "node"
brew "markdownlint-cli2"
brew "neovim"
brew "openssh"
brew "ripgrep"
brew "starship"
brew "stow"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "zoxide"
brew "fsouza/prettierd/prettierd"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "clipy"
cask "font-monaspace"
cask "hiddenbar"
cask "iterm2"
cask "stats"
cask "zed"
vscode "bibhasdn.unique-lines"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "jeigsaw.olive-light-theme"
vscode "juliogold.vscode-smart-split-into-lines"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "tyriar.sort-lines"
vscode "wesbos.theme-cobalt2"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
